; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p4---int100n150-m25---int100c200---s43---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level21 level50)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level21 level51)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level21 level52)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level21 level53)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level33 level21 level54)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level34 level21 level55)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level35 level21 level56)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level36 level21 level57)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level37 level21 level58)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level38 level7 level45)
(sum level38 level21 level59)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level39 level7 level46)
(sum level39 level21 level60)
(sum level39 level24 level63)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level5 level45)
(sum level40 level7 level47)
(sum level40 level21 level61)
(sum level40 level24 level64)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level5 level46)
(sum level41 level7 level48)
(sum level41 level21 level62)
(sum level41 level24 level65)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level5 level47)
(sum level42 level7 level49)
(sum level42 level21 level63)
(sum level42 level24 level66)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level5 level48)
(sum level43 level7 level50)
(sum level43 level21 level64)
(sum level43 level24 level67)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level5 level49)
(sum level44 level7 level51)
(sum level44 level21 level65)
(sum level44 level24 level68)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level5 level50)
(sum level45 level7 level52)
(sum level45 level21 level66)
(sum level45 level24 level69)
(sum level45 level25 level70)
(sum level46 level3 level49)
(sum level46 level5 level51)
(sum level46 level7 level53)
(sum level46 level21 level67)
(sum level46 level24 level70)
(sum level46 level25 level71)
(sum level47 level3 level50)
(sum level47 level5 level52)
(sum level47 level7 level54)
(sum level47 level21 level68)
(sum level47 level24 level71)
(sum level47 level25 level72)
(sum level48 level3 level51)
(sum level48 level5 level53)
(sum level48 level7 level55)
(sum level48 level21 level69)
(sum level48 level24 level72)
(sum level48 level25 level73)
(sum level49 level3 level52)
(sum level49 level5 level54)
(sum level49 level7 level56)
(sum level49 level21 level70)
(sum level49 level24 level73)
(sum level49 level25 level74)
(sum level50 level3 level53)
(sum level50 level5 level55)
(sum level50 level7 level57)
(sum level50 level21 level71)
(sum level50 level24 level74)
(sum level50 level25 level75)
(sum level51 level3 level54)
(sum level51 level5 level56)
(sum level51 level7 level58)
(sum level51 level21 level72)
(sum level51 level24 level75)
(sum level51 level25 level76)
(sum level52 level3 level55)
(sum level52 level5 level57)
(sum level52 level7 level59)
(sum level52 level21 level73)
(sum level52 level24 level76)
(sum level52 level25 level77)
(sum level53 level3 level56)
(sum level53 level5 level58)
(sum level53 level7 level60)
(sum level53 level21 level74)
(sum level53 level24 level77)
(sum level53 level25 level78)
(sum level54 level3 level57)
(sum level54 level5 level59)
(sum level54 level7 level61)
(sum level54 level21 level75)
(sum level54 level24 level78)
(sum level54 level25 level79)
(sum level55 level3 level58)
(sum level55 level5 level60)
(sum level55 level7 level62)
(sum level55 level21 level76)
(sum level55 level24 level79)
(sum level55 level25 level80)
(sum level56 level3 level59)
(sum level56 level5 level61)
(sum level56 level7 level63)
(sum level56 level21 level77)
(sum level56 level24 level80)
(sum level56 level25 level81)
(sum level57 level3 level60)
(sum level57 level5 level62)
(sum level57 level7 level64)
(sum level57 level21 level78)
(sum level57 level24 level81)
(sum level57 level25 level82)
(sum level58 level3 level61)
(sum level58 level5 level63)
(sum level58 level7 level65)
(sum level58 level21 level79)
(sum level58 level24 level82)
(sum level58 level25 level83)
(sum level59 level3 level62)
(sum level59 level5 level64)
(sum level59 level7 level66)
(sum level59 level21 level80)
(sum level59 level24 level83)
(sum level59 level25 level84)
(sum level60 level3 level63)
(sum level60 level5 level65)
(sum level60 level7 level67)
(sum level60 level21 level81)
(sum level60 level24 level84)
(sum level60 level25 level85)
(sum level61 level3 level64)
(sum level61 level5 level66)
(sum level61 level7 level68)
(sum level61 level21 level82)
(sum level61 level24 level85)
(sum level61 level25 level86)
(sum level62 level3 level65)
(sum level62 level5 level67)
(sum level62 level7 level69)
(sum level62 level21 level83)
(sum level62 level24 level86)
(sum level62 level25 level87)
(sum level63 level3 level66)
(sum level63 level5 level68)
(sum level63 level7 level70)
(sum level63 level21 level84)
(sum level63 level24 level87)
(sum level63 level25 level88)
(sum level64 level3 level67)
(sum level64 level5 level69)
(sum level64 level7 level71)
(sum level64 level21 level85)
(sum level64 level24 level88)
(sum level64 level25 level89)
(sum level65 level3 level68)
(sum level65 level5 level70)
(sum level65 level7 level72)
(sum level65 level21 level86)
(sum level65 level24 level89)
(sum level65 level25 level90)
(sum level66 level3 level69)
(sum level66 level5 level71)
(sum level66 level7 level73)
(sum level66 level21 level87)
(sum level66 level24 level90)
(sum level66 level25 level91)
(sum level67 level3 level70)
(sum level67 level5 level72)
(sum level67 level7 level74)
(sum level67 level21 level88)
(sum level67 level24 level91)
(sum level67 level25 level92)
(sum level68 level3 level71)
(sum level68 level5 level73)
(sum level68 level7 level75)
(sum level68 level21 level89)
(sum level68 level24 level92)
(sum level68 level25 level93)
(sum level69 level3 level72)
(sum level69 level5 level74)
(sum level69 level7 level76)
(sum level69 level21 level90)
(sum level69 level24 level93)
(sum level69 level25 level94)
(sum level70 level3 level73)
(sum level70 level5 level75)
(sum level70 level7 level77)
(sum level70 level21 level91)
(sum level70 level24 level94)
(sum level70 level25 level95)
(sum level71 level3 level74)
(sum level71 level5 level76)
(sum level71 level7 level78)
(sum level71 level21 level92)
(sum level71 level24 level95)
(sum level71 level25 level96)
(sum level72 level3 level75)
(sum level72 level5 level77)
(sum level72 level7 level79)
(sum level72 level21 level93)
(sum level72 level24 level96)
(sum level72 level25 level97)
(sum level73 level3 level76)
(sum level73 level5 level78)
(sum level73 level7 level80)
(sum level73 level21 level94)
(sum level73 level24 level97)
(sum level73 level25 level98)
(sum level74 level3 level77)
(sum level74 level5 level79)
(sum level74 level7 level81)
(sum level74 level21 level95)
(sum level74 level24 level98)
(sum level74 level25 level99)
(sum level75 level3 level78)
(sum level75 level5 level80)
(sum level75 level7 level82)
(sum level75 level21 level96)
(sum level75 level24 level99)
(sum level75 level25 level100)
(sum level76 level3 level79)
(sum level76 level5 level81)
(sum level76 level7 level83)
(sum level76 level21 level97)
(sum level76 level24 level100)
(sum level76 level25 level101)
(sum level77 level3 level80)
(sum level77 level5 level82)
(sum level77 level7 level84)
(sum level77 level21 level98)
(sum level77 level24 level101)
(sum level77 level25 level102)
(sum level78 level3 level81)
(sum level78 level5 level83)
(sum level78 level7 level85)
(sum level78 level21 level99)
(sum level78 level24 level102)
(sum level78 level25 level103)
(sum level79 level3 level82)
(sum level79 level5 level84)
(sum level79 level7 level86)
(sum level79 level21 level100)
(sum level79 level24 level103)
(sum level79 level25 level104)
(sum level80 level3 level83)
(sum level80 level5 level85)
(sum level80 level7 level87)
(sum level80 level21 level101)
(sum level80 level24 level104)
(sum level80 level25 level105)
(sum level81 level3 level84)
(sum level81 level5 level86)
(sum level81 level7 level88)
(sum level81 level21 level102)
(sum level81 level24 level105)
(sum level81 level25 level106)
(sum level82 level3 level85)
(sum level82 level5 level87)
(sum level82 level7 level89)
(sum level82 level21 level103)
(sum level82 level24 level106)
(sum level82 level25 level107)
(sum level83 level3 level86)
(sum level83 level5 level88)
(sum level83 level7 level90)
(sum level83 level21 level104)
(sum level83 level24 level107)
(sum level83 level25 level108)
(sum level84 level3 level87)
(sum level84 level5 level89)
(sum level84 level7 level91)
(sum level84 level21 level105)
(sum level84 level24 level108)
(sum level84 level25 level109)
(sum level85 level3 level88)
(sum level85 level5 level90)
(sum level85 level7 level92)
(sum level85 level21 level106)
(sum level85 level24 level109)
(sum level85 level25 level110)
(sum level86 level3 level89)
(sum level86 level5 level91)
(sum level86 level7 level93)
(sum level86 level21 level107)
(sum level86 level24 level110)
(sum level87 level3 level90)
(sum level87 level5 level92)
(sum level87 level7 level94)
(sum level87 level21 level108)
(sum level88 level3 level91)
(sum level88 level5 level93)
(sum level88 level7 level95)
(sum level88 level21 level109)
(sum level89 level3 level92)
(sum level89 level5 level94)
(sum level89 level7 level96)
(sum level89 level21 level110)
(sum level90 level3 level93)
(sum level90 level5 level95)
(sum level90 level7 level97)
(sum level91 level3 level94)
(sum level91 level5 level96)
(sum level91 level7 level98)
(sum level92 level3 level95)
(sum level92 level5 level97)
(sum level92 level7 level99)
(sum level93 level3 level96)
(sum level93 level5 level98)
(sum level93 level7 level100)
(sum level94 level3 level97)
(sum level94 level5 level99)
(sum level94 level7 level101)
(sum level95 level3 level98)
(sum level95 level5 level100)
(sum level95 level7 level102)
(sum level96 level3 level99)
(sum level96 level5 level101)
(sum level96 level7 level103)
(sum level97 level3 level100)
(sum level97 level5 level102)
(sum level97 level7 level104)
(sum level98 level3 level101)
(sum level98 level5 level103)
(sum level98 level7 level105)
(sum level99 level3 level102)
(sum level99 level5 level104)
(sum level99 level7 level106)
(sum level100 level3 level103)
(sum level100 level5 level105)
(sum level100 level7 level107)
(sum level101 level3 level104)
(sum level101 level5 level106)
(sum level101 level7 level108)
(sum level102 level3 level105)
(sum level102 level5 level107)
(sum level102 level7 level109)
(sum level103 level3 level106)
(sum level103 level5 level108)
(sum level103 level7 level110)
(sum level104 level3 level107)
(sum level104 level5 level109)
(sum level105 level3 level108)
(sum level105 level5 level110)
(sum level106 level3 level109)
(sum level107 level3 level110)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l3)
(fuelcost level5 l0 l3)
(connected l0 l4)
(fuelcost level7 l0 l4)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l1 l3)
(fuelcost level24 l1 l3)
(connected l2 l1)
(fuelcost level25 l2 l1)
(connected l2 l3)
(fuelcost level21 l2 l3)
(connected l2 l4)
(fuelcost level25 l2 l4)
(connected l3 l0)
(fuelcost level5 l3 l0)
(connected l3 l1)
(fuelcost level24 l3 l1)
(connected l3 l2)
(fuelcost level21 l3 l2)
(connected l4 l0)
(fuelcost level7 l4 l0)
(connected l4 l2)
(fuelcost level25 l4 l2)

(at t0 l4)
(fuel t0 level110)
(= (total-cost) 0)

(at p0 l4)
(at p1 l3)
(at p2 l4)
(at p3 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l0)
(at p3 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 4
2. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 4
3. (drive t0 l4 l0 level103 level7 level110)
   deleted: (at t0 l4) (fuel t0 level110)
   added: (at t0 l0) (fuel t0 level103)
   goals met: 0 of 4
4. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 1 of 4
5. (drive t0 l0 l3 level98 level5 level103)
   deleted: (at t0 l0) (fuel t0 level103)
   added: (at t0 l3) (fuel t0 level98)
   goals met: 1 of 4
6. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 1 of 4
7. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 4
8. (drive t0 l3 l1 level74 level24 level98)
   deleted: (at t0 l3) (fuel t0 level98)
   added: (at t0 l1) (fuel t0 level74)
   goals met: 1 of 4
9. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 4
10. (drive t0 l1 l2 level49 level25 level74)
   deleted: (at t0 l1) (fuel t0 level74)
   added: (at t0 l2) (fuel t0 level49)
   goals met: 2 of 4
11. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 3 of 4
12. (drive t0 l2 l4 level24 level25 level49)
   deleted: (at t0 l2) (fuel t0 level49)
   added: (at t0 l4) (fuel t0 level24)
   goals met: 3 of 4
13. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 4 of 4
